kilng235/ai-passport-bridge/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 3 MB 应用上限与固定保护分区保持一致。分区表保留
# cardid@0x356000，二创不得移动或覆盖。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# 中文:按"源码实际用到的字"从思源黑体生成 14px 子集(main/lv_font_hansans_14_cjk.c),
# 经 main/ui_font.c 作为 Montserrat 的回退,实现中英混排。源字体来自 LVGL 组件:
#   lv_font_conv --font managed_components/lvgl__lvgl/scripts/built_in_font/SourceHanSansSC-Normal.otf \
#     --size 14 --bpp 4 --symbols font/symbols.txt --format lvgl --lv-include lvgl.h \
#     -o main/lv_font_hansans_14_cjk.c
# 注意:lv_font_conv 默认对字形位图做 RLE 压缩(bitmap_format=1),必须同时打开
# LVGL 的压缩字体解码,否则 get_glyph_bitmap 直接返回 NULL → 屏上中文全部空白。
CONFIG_LV_USE_FONT_COMPRESSED=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 本 demo UI 简单,24KB 足够;若自建复杂界面出现绘制卡死/看门狗,调大此值。
CONFIG_LV_MEM_SIZE_KILOBYTES=24

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# --- 电源管理:DFS 调频 + 自动浅睡 ---
# 开关由 main.c 的 esp_pm_configure() 设定(160/80MHz + light_sleep_enable)。
# 屏幕亮时经背光持 NO_LIGHT_SLEEP 锁(见 bsp_display.c),防止 LEDC 背光在浅睡中停摆;
# 熄屏后放锁,空闲即可自动浅睡,把待机电流从 ~25mA 降到个位数 mA。
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_PM_SLP_IRAM_OPT=y
CONFIG_PM_RTOS_IDLE_OPT=y
# ESP32-C3 的 USB-Serial-JTAG 在浅睡下无法工作。插着 USB 时禁止自动浅睡,
# 否则设备熄屏进入浅睡后 esptool/网页烧录器会报 "No serial data received"(连不上)。
# 拔掉 USB 后仍可正常浅睡,不影响功耗目标。
CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION=y

# --- 按键 ---
# 长按判定阈值(ms)。默认 1.5s 太久,容易被当成单击(单击=进入选中项,看着像"刷新")。
CONFIG_BUTTON_LONG_PRESS_TIME_MS=800

# --- Bluetooth ---
# 当前固件无 BLE 页面(demo_ble 未编入 SRCS、菜单也无入口);禁用整棵蓝牙栈以省 flash/RAM。
# CONFIG_BT_ENABLED is not set

# Wi-Fi 缓冲:小而稳,给配网扫描与通知服务的 HTTP 留出内存。
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=8
# CONFIG_ESP_WIFI_ENABLE_WPA3_SAE is not set
